In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('./data/scientists.csv')

In [19]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [23]:
set([1,2,3,3,4,4,5])

{1, 2, 3, 4, 5}

In [20]:
set(df['Age'])

{37, 41, 45, 56, 61, 66, 77, 90}

In [24]:
mapper = {37 : '30s',
          41 : '40s',
          45 : '40s',
          56 : '50s',
          61 : '60s',
          66 : '60s',
          77 : '70s',
          90 : '90s'}

In [25]:
df['New_Age'] = df['Age'].map(mapper)

In [26]:
set(df['New_Age'])

{'30s', '40s', '50s', '60s', '70s', '90s'}

In [27]:
df

,Name,Born,Died,Age,Occupation,New_Age
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,30s
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,60s
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,90s
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,60s
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,50s
5,John Snow,1813-03-15,1858-06-16,45,Physician,40s
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,40s
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,70s

In [28]:
df.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'New_Age'], dtype='object')

In [31]:
interested = ['Name', 'Born', 'Died', 'New_Age']
df[interested].to_csv('./data/new_scientists.csv', index=False)

In [32]:
df = pd.read_csv('./data/new_scientists.csv')
df

                   Name        Born        Died New_Age
0     Rosaline Franklin  1920-07-25  1958-04-16     30s
1        William Gosset  1876-06-13  1937-10-16     60s
2  Florence Nightingale  1820-05-12  1910-08-13     90s
3           Marie Curie  1867-11-07  1934-07-04     60s
4         Rachel Carson  1907-05-27  1964-04-14     50s
5             John Snow  1813-03-15  1858-06-16     40s
6           Alan Turing  1912-06-23  1954-06-07     40s
7          Johann Gauss  1777-04-30  1855-02-23     70s